microsoft/uf2-samdx1/lib/samd21/samd21a/atdf/ATSAMD21E15A.atdf
      <value-group name="PENDSTSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: SysTick exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes SysTick exception state to pending; read: SysTick exception is pending"/>
      </value-group>
      <value-group name="PENDSVCLR">
        <value value="0" name="VALUE_0" caption="no effect"/>
        <value value="1" name="VALUE_1" caption="removes the pending state from the PendSV exception"/>
      </value-group>
      <value-group name="PENDSVSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: PendSV exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes PendSV exception state to pending; read: PendSV exception is pending"/>
      </value-group>
      <value-group name="NMIPENDSET">
        <value value="0" name="VALUE_0" caption="write: no effect; read: NMI exception is not pending"/>
        <value value="1" name="VALUE_1" caption="write: changes NMI exception state to pending; read: NMI exception is pending"/>
      </value-group>
      <value-group name="SYSRESETREQ">
        <value value="0" name="VALUE_0" caption="no system reset request"/>
        <value value="1" name="VALUE_1" caption="asserts a signal to the outer system that requests a reset"/>
      </value-group>
      <value-group name="ENDIANNESS">
        <value value="0" name="VALUE_0" caption="Little-endian"/>
        <value value="1" name="VALUE_1" caption="Big-endian"/>
      </value-group>
      <value-group name="SLEEPONEXIT">
        <value value="0" name="VALUE_0" caption="o not sleep when returning to Thread mode"/>
        <value value="1" name="VALUE_1" caption="enter sleep, or deep sleep, on return from an ISR"/>
      </value-group>
      <value-group name="SLEEPDEEP">
        <value value="0" name="VALUE_0" caption="sleep"/>
        <value value="1" name="VALUE_1" caption="deep sleep"/>
      </value-group>
      <value-group name="SEVONPEND">
        <value value="0" name="VALUE_0" caption="only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded"/>
        <value value="1" name="VALUE_1" caption="enabled events and all interrupts, including disabled interrupts, can wakeup the processor"/>
      </value-group>
      <value-group name="UNALIGN_TRP">
        <value value="0" name="VALUE_0" caption="do not trap unaligned halfword and word accesses"/>
        <value value="1" name="VALUE_1" caption="trap unaligned halfword and word accesses"/>
      </value-group>
      <value-group name="STKALIGN">
        <value value="0" name="VALUE_0" caption="4-byte aligned"/>
        <value value="1" name="VALUE_1" caption="8-byte aligned"/>
      </value-group>
    </module><module name="SysTick" caption="System timer">
      <register-group name="SysTick" caption="System timer">
        <register offset="0x00000000" size="4" name="CSR" initval="0x4" caption="SysTick Control and Status Register">
          <bitfield mask="0x00000001" name="ENABLE" values="ENABLE" caption="no description available"/>
          <bitfield mask="0x00000002" name="TICKINT" values="TICKINT" caption="no description available"/>
          <bitfield mask="0x00000004" name="CLKSOURCE" values="CLKSOURCE" caption="no description available"/>
          <bitfield mask="0x00010000" name="COUNTFLAG" caption="no description available"/>
        </register>
        <register offset="0x00000004" size="4" name="RVR" initval="0" caption="SysTick Reload Value Register">
          <bitfield mask="0x00ffffff" name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0"/>
        </register>
        <register offset="0x00000008" size="4" name="CVR" initval="0" caption="SysTick Current Value Register">
          <bitfield mask="0x00ffffff" name="CURRENT" caption="Current value at the time the register is accessed"/>
        </register>
        <register offset="0x0000000c" size="4" name="CALIB" initval="0" caption="SysTick Calibration Value Register">
          <bitfield mask="0x00ffffff" name="TENMS" caption="Reload value to use for 10ms timing"/>
          <bitfield mask="0x40000000" name="SKEW" values="SKEW" caption="no description available"/>
          <bitfield mask="0x80000000" name="NOREF" values="NOREF" caption="no description available"/>
        </register>
      </register-group>
      <value-group name="ENABLE">
        <value value="0" name="VALUE_0" caption="counter disabled"/>
        <value value="1" name="VALUE_1" caption="counter enabled"/>
      </value-group>
      <value-group name="TICKINT">
        <value value="0" name="VALUE_0" caption="counting down to 0 does not assert the SysTick exception request"/>
        <value value="1" name="VALUE_1" caption="counting down to 0 asserts the SysTick exception request"/>
      </value-group>
      <value-group name="CLKSOURCE">
        <value value="0" name="VALUE_0" caption="external clock"/>
        <value value="1" name="VALUE_1" caption="processor clock"/>
      </value-group>
      <value-group name="SKEW">
        <value value="0" name="VALUE_0" caption="10ms calibration value is exact"/>
        <value value="1" name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency"/>
      </value-group>
      <value-group name="NOREF">
        <value value="0" name="VALUE_0" caption="The reference clock is provided"/>
        <value value="1" name="VALUE_1" caption="The reference clock is not provided"/>
      </value-group>
    </module><module name="NVIC" caption="Nested Vectored Interrupt Controller">
      <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
        <register offset="0x00000000" size="4" name="NVICISER" initval="0" caption="Interrupt Set Enable Register">
          <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
        </register>
        <register offset="0x00000080" size="4" name="NVICICER" initval="0" caption="Interrupt Clear Enable Register">
          <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
        </register>
        <register offset="0x00000100" size="4" name="NVICISPR" initval="0" caption="Interrupt Set Pending Register">
          <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
        </register>
